Revit 2024 API
FabricationPart.LiningArea Property
 The lining area of the fabrication part. If the fabrication part is not lined, returns zero.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public double LiningArea { get; }
Visual Basic
Public ReadOnly Property LiningArea As Double
	Get
Visual C++
public:
property double LiningArea {
	double get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace